src/Documents/СчетНаОплатуПокупателю/СчетНаОплатуПокупателю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0ff61b1f-319d-49ab-b803-5631722395e9">
  <name>СчетНаОплатуПокупателю</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.bz_РаботыКВыставлению</registerRecords>
  <attributes extendedConfigurationObject="08aa07ae-cd86-4d54-b490-c15802d417fc">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3adbcfdd-070d-4460-acc3-308bd0111232">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="588c2b48-4807-443b-8953-7768a7a7f50d">
    <name>УдалитьУчитыватьНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da669888-c3b8-4635-9efa-361a5c5a6f9d">
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01092448-a09b-4969-8f36-13d92209e6e1">
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="214d329f-5b74-4de0-b441-d5bcd7e6bf6d">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ac25737-fc28-4cd3-b452-6602df933243">
    <name>ПодразделениеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6da3a389-1772-4d4b-921c-21b2c3c84371">
    <name>УдалитьСтатусОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="21c270e6-ee45-4227-b4ea-9be9536dfb85">
    <name>СуммаСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="169339fd-dd59-40c4-984c-54b4a3a8d2fc">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5980526e-6944-4394-b430-c800d7db4ad7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="298776ee-df38-4768-a8e7-a19a1f8f6512">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c3457825-c642-4d7e-8579-745108df4f25">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bc8f1db9-d2e2-4b3c-b97b-da48a0facf7c">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6d63bb33-3a50-4aec-a5f4-a775b411069a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a9f5d888-a026-4ba7-986a-24b854e01d12">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c2f62a9f-c4a7-44ab-9835-bf421c44991a">
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d3ad462c-3344-468f-a311-d36bcd9feda9">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="14135b62-d48b-4e21-aa09-11564ea9d8ac">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f1adceb4-0ccb-4265-9cc4-4775051b5e67">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="30113ade-686b-4d63-8b93-5a4962d8c962">
      <name>ПроцентСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>4</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="660b9de9-c09d-41f9-8d93-eb81b209e968">
      <name>СуммаСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="942d6898-5586-4593-8fea-f1400f5f6079">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dbe0ac99-d607-4df9-a10f-a841047c7d04">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>bz_ВыставляемыеРаботы</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.bz_Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.bz_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.bz_Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервичныйДокумент</name>
      <type>
        <types>DocumentRef.bz_ВыставлениеРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиПервичногоДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c5609066-9f52-449a-abc8-2203fea36ab5">
    <name>ВозвратнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4b97b65c-0d5a-492f-ae09-9202f6cd13f3">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="73099c37-5854-4cab-b596-bdea5bb1845d">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e1ae6165-a27b-4890-bd78-3760e5def356">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2b77abf6-35fb-46b4-806e-6d7482276b64">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="059b14f5-f4da-4cbe-b6df-3782ca3d35ef">
    <name>УдалитьУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c6a34c21-083b-41ba-9f64-d00837541608">
    <name>РеквизитыКодаДляОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/Documents/СчетНаОплатуПокупателю/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура bz_ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.bz_ВыставленныеРаботы.Записывать = Истина;
	Для Каждого стр Из bz_ВыставляемыеРаботы Цикл
		Движение = Движения.bz_ВыставленныеРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(Движение, стр);
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Документ = стр.ПервичныйДокумент;
		Движение.НомерСтр = стр.НомерСтрокиПервичногоДокумента;
		Движение.КоличествоКВыставлению = стр.Количество;
		Движение.СуммаКВыставлению = стр.Сумма;
	КонецЦикла;
КонецПроцедуры
